Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/reference/case_studies/case_study_public_holiday_entitlement.html.txt.tmx
Source language: en
Languages: ga

source: Case study: Public holiday entitlement
ga: Cás-Staidéar ar theidlíocht saoire poiblí

source: Daniel has been working part-time since June
ga: Tá Daniel ag obair go páirtaimseartha ó Mheitheamh

source: He works from Tuesday to Saturday each week from 6 pm to 9 pm
ga: Oibríonn sé Máirt go Satharn gach seachtain ó 6in go dtí 9in

source: The other staff who are all full-time had a day off when the shop was closed for the public holiday in August
ga: Bhí lá saor ag na baill fhoirne eile ar fad atá lánaimseartha nuair a bhí an siopa dúnta don saoire phoiblí i mí Lúnasa

source: Daniel found out that they were paid for this public holiday and they told him he should also be paid for that day
ga: Fuair Daniel amach gur íocadh leo don tsaoire poiblí seo agus dúirt siad leis gur chóir go mbeadh sé íoctha chomh maith

source: He asked his employer about this but the employer told him since he never worked on a Monday, he had no right be paid for public holidays
ga: D'iarr sé ar a fhostóir faoi seo ach dúirt a fhostóir leis ós rud é nár oibrigh sé Dé Luain, ní raibh aon cheart aige d'íocaíocht ar shaoire phoiblí

source: Daniel's employer is wrong
ga: Tá fostóir Daniel mícheart

source: Before the August public holiday he had worked in the shop for 15 hours a week for 7 weeks which came to a total of 105 hours
ga: Roimh shaoire phoiblí Lúnasa, bhí 15 uaireanta sa tseachtain ar feadh 7 seachtain oibrithe aige sa siopa leabhair a tháinig go dtí iomlán de 105 uaireanta

source: This meant he was entitled to public holiday leave under the Organisation of Working Time Act 1997
ga: Chiallaigh sé seo go raibh sé i dteideal íocaíocht ar shaoire phoiblí faoin Acht um Eagrú Ama Oibre 1997

source: As he was not due to work on the day of the public holiday he is entitled to one-fifth of his normal weekly pay
ga: Ós rud é nach raibh dualgas ar oibriú ar an lá a thit an tsaoire phoiblí tá sé i dteideal d'aon cúigiú dá ghnáthphá seachtainiúil

source: Daniel should therefore receive an extra 3 hours' pay
ga: Ba chóir do Daniel mar sin 3 uaire bhreise pá a fháil
